app/controllers/twaats_controller.rb

  def index
    @twaats = Twaat.all
---
SELECT "twaats".* FROM "twaats"