app/controllers/twaats_controller.rb

  def create
    @twaat = Twaat.new(twaat_params)

    respond_to do |format|
      if @twaat.save
---
INSERT INTO "twaats" ("content", "img_url", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "test"], ["img_url", ""], ["created_at", 2017-04-13 07:12:15 UTC], ["updated_at", 2017-04-13 07:12:15 UTC], ["user_id", 2]]

  def destroy
    @twaat.destroy
---
DELETE FROM "twaats" WHERE "twaats"."id" = ?  [["id", 3]]

    def set_twaat
      @twaat = Twaat.find(params[:id])
---
SELECT  "twaats".* FROM "twaats" WHERE "twaats"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]