app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("Username", "img_url", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["Username", "Nicolas les singes"], ["img_url", "http://data.whicdn.com/images/25103052/original.png"], ["created_at", 2017-03-09 07:50:42 UTC], ["updated_at", 2017-03-09 07:50:42 UTC]]